<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1ca796f201ddc99c91d3e52f27dd2c3a6d136333f53285f1fd74f5ef6d00c4e5","plan_job_ref":"Job Plan Airflow DAGs #471 at https://github.com/cal-itp/data-infra/actions/runs/16918195641","plan_out_hash":"8731ffc610c6378ee347f394eb60ff6203a8df6dbe204dd02f864f4142ac2a16","plan_hash":"b93118d1b398be99761492531ec817790cc3c90a7f9de4017403d530900c3f7f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 5 to add, 17 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "lHo3jQ==" -> (known after apply)
!~      detect_md5hash      = "Kzyj6qWh6V5vCBLXNfgW9Q==" -> "different hash"
!~      generation          = 1754938421374278 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "Kzyj6qWh6V5vCBLXNfgW9Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_stop_time_metrics.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_stop_time_updates_sample.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_sample.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_stop_time_updates_sample.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_stop_metrics.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_trip_metrics.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/amplitude/_amplitude.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5ai1mg==" -> (known after apply)
!~      detect_md5hash      = "CCXiffBEEPZ5HLszdyijvw==" -> "different hash"
!~      generation          = 1750272586608596 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/amplitude/_amplitude.yml"
!~      md5hash             = "CCXiffBEEPZ5HLszdyijvw==" -> (known after apply)
        name                = "data/warehouse/models/staging/amplitude/_amplitude.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/audit/_src_audit.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "yeSEyg==" -> (known after apply)
!~      detect_md5hash      = "LP1avYyKTuGYkgdiP9r8GA==" -> "different hash"
!~      generation          = 1750272586667701 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/audit/_src_audit.yml"
!~      md5hash             = "LP1avYyKTuGYkgdiP9r8GA==" -> (known after apply)
        name                = "data/warehouse/models/staging/audit/_src_audit.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "JRuXXA==" -> (known after apply)
!~      detect_md5hash      = "Caqsk8kIhrzLrYxkwYo53g==" -> "different hash"
!~      generation          = 1750272586302774 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
!~      md5hash             = "Caqsk8kIhrzLrYxkwYo53g==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/hqta/_hqta.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Uuiodw==" -> (known after apply)
!~      detect_md5hash      = "E8kXOfywGmTU9ixt2SEdjw==" -> "different hash"
!~      generation          = 1750272586686096 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/hqta/_hqta.yml"
!~      md5hash             = "E8kXOfywGmTU9ixt2SEdjw==" -> (known after apply)
        name                = "data/warehouse/models/staging/hqta/_hqta.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "6xrw7Q==" -> (known after apply)
!~      detect_md5hash      = "u1GUGr+qHvrdM3CByD7P5g==" -> "different hash"
!~      generation          = 1750272586323842 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/_src.yml"
!~      md5hash             = "u1GUGr+qHvrdM3CByD7P5g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_annual_reporting/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_assets/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "xZy+xA==" -> (known after apply)
!~      detect_md5hash      = "D87Dg9H2Ttxydrw5TCb+kw==" -> "different hash"
!~      generation          = 1750272586475821 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_assets/_src.yml"
!~      md5hash             = "D87Dg9H2Ttxydrw5TCb+kw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_assets/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_funding_and_expenses/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Rk9vbA==" -> (known after apply)
!~      detect_md5hash      = "1oG4kAhIV+IUFXaMzCafdg==" -> "different hash"
!~      generation          = 1750272586292078 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_funding_and_expenses/_src.yml"
!~      md5hash             = "1oG4kAhIV+IUFXaMzCafdg==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_funding_and_expenses/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_ridership/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "vxfhWw==" -> (known after apply)
!~      detect_md5hash      = "tIKyKSkVeHX6Hy5dMmfDkg==" -> "different hash"
!~      generation          = 1750272586525890 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_ridership/_src.yml"
!~      md5hash             = "tIKyKSkVeHX6Hy5dMmfDkg==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_ridership/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_safety_and_security/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "UafDoQ==" -> (known after apply)
!~      detect_md5hash      = "YKlzWmQqTtpcNtTyZJwXKw==" -> "different hash"
!~      generation          = 1750272586628328 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_safety_and_security/_src.yml"
!~      md5hash             = "YKlzWmQqTtpcNtTyZJwXKw==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_safety_and_security/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_validation/_src_api_externaltable.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "aVRpvA==" -> (known after apply)
!~      detect_md5hash      = "V377ulINuAVHuOmUpO696g==" -> "different hash"
!~      generation          = 1750272586278361 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_validation/_src_api_externaltable.yml"
!~      md5hash             = "V377ulINuAVHuOmUpO696g==" -> (known after apply)
        name                = "data/warehouse/models/staging/ntd_validation/_src_api_externaltable.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/elavon/_elavon.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "K73NkQ==" -> (known after apply)
!~      detect_md5hash      = "F3n1bpsPdvlWZzdDllkL5g==" -> "different hash"
!~      generation          = 1750272586545333 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/elavon/_elavon.yml"
!~      md5hash             = "F3n1bpsPdvlWZzdDllkL5g==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/elavon/_elavon.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/littlepay/_littlepay.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "z0l1MQ==" -> (known after apply)
!~      detect_md5hash      = "pQ3Or9N/wSYHXt235de9Zw==" -> "different hash"
!~      generation          = 1750272586275125 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/littlepay/_littlepay.yml"
!~      md5hash             = "pQ3Or9N/wSYHXt235de9Zw==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/littlepay/_littlepay.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/payments/littlepay_v3/_littlepay_v3.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "OLGd3Q==" -> (known after apply)
!~      detect_md5hash      = "CT1Is41WF82GxtvZlgAPfw==" -> "different hash"
!~      generation          = 1750272586603820 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/payments/littlepay_v3/_littlepay_v3.yml"
!~      md5hash             = "CT1Is41WF82GxtvZlgAPfw==" -> (known after apply)
        name                = "data/warehouse/models/staging/payments/littlepay_v3/_littlepay_v3.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/state_geoportal/_src.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "wL4kuQ==" -> (known after apply)
!~      detect_md5hash      = "RurA8+fnfohppuRhvXSA1w==" -> "different hash"
!~      generation          = 1750272586631531 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/state_geoportal/_src.yml"
!~      md5hash             = "RurA8+fnfohppuRhvXSA1w==" -> (known after apply)
        name                = "data/warehouse/models/staging/state_geoportal/_src.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/transit_database/_src_airtable.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "XoDIpQ==" -> (known after apply)
!~      detect_md5hash      = "L1F0Z7s3z9BVOE64Fg/zDg==" -> "different hash"
!~      generation          = 1750272586297144 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/transit_database/_src_airtable.yml"
!~      md5hash             = "L1F0Z7s3z9BVOE64Fg/zDg==" -> (known after apply)
        name                = "data/warehouse/models/staging/transit_database/_src_airtable.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "21cxqg==" -> (known after apply)
!~      detect_md5hash      = "Z7SYWkQVGJixDDXvD4i86w==" -> "different hash"
!~      generation          = 1754938422967236 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "Z7SYWkQVGJixDDXvD4i86w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 5 to add, 17 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #471](https://github.com/cal-itp/data-infra/actions/runs/16918195641)